import React from "react";
import image from "public/timeline2.png";
import TimelineWeb2 from "./TimelineWeb2";

const WebTimeline2 = () => {
  const data1 = [
    {
      id: 1,
      img: image,
      title: "الشهادة الاحترافية المعتمدة في أمن نظم المعلومات (CISSP)",
      desc: "تعد هذه الشهادة دليلاً على القدرة على تصميم وتنفيذ وإدارة برنامج الأمن السيبراني الأفضل في فئته. وفي الولايات المتحدة الأمريكية، تشبه هذه الشهادة مؤهل مستوى الماجستير. هذا هو مدى خطورة الأمر، ولهذا السبب نحن فخورون جدًا بأن العديد من أعضاء فريقنا قد حصلوا عليه.",
    },
  ];
  const data2 = [
    {
      id: 2,
      img: image,
      title: "AICPA SOC 2 النوع 2",
      desc: "نحن أحد MSP القلائل الحاصلين على هذه الشهادة. نحن فخورون بكوننا جزءًا من مجموعة النخبة التي تأخذ الأمن السيبراني على محمل الجد ولديها الأدلة التي تدعم التزامنا. SOC 2 هو اختبار لسياساتنا وإجراءاتنا الصارمة المتعلقة بأمن المعلومات والتي تشمل أمان بيانات العملاء وتوافرها ومعالجتها وسلامتها وسريتها.",
    },
  ];
  const data3 = [
    {
      id: 3,
      img: image,
      title: "AICPA SOC 2 النوع 2",
      desc: "نحن أحد MSP القلائل الحاصلين على هذه الشهادة. نحن فخورون بكوننا جزءًا من مجموعة النخبة التي تأخذ الأمن السيبراني على محمل الجد ولديها الأدلة التي تدعم التزامنا. SOC 2 هو اختبار لسياساتنا وإجراءاتنا الصارمة المتعلقة بأمن المعلومات والتي تشمل أمان بيانات العملاء وتوافرها ومعالجتها وسلامتها وسريتها.",
    },
  ];
  return (
    <div className="flex flex-col gap-0 padding-y padding-x">
      <TimelineWeb2 timeline={data1} />
      <TimelineWeb2 timeline={data2} />
      <TimelineWeb2 timeline={data3} />
    </div>
  );
};

export default WebTimeline2;
